In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [8]:
!wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz

--2023-01-28 13:47:41--  https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz
Resolving github.com (github.com)... 20.205.243.166
Connecting to github.com (github.com)|20.205.243.166|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230128%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230128T064742Z&X-Amz-Expires=300&X-Amz-Signature=2d82c1bbfedc99fe7158d69432d26e55eb3a7293439c8824acd2a029de55006b&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream [following]
--2023-01-28 13:47:46--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/d3904232-1a2b-431b-803d-0ee802cd14fc?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230128%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20230128T064742Z&X-Amz-Expires=300&X-Amz-Signature=2d82c1bbfedc99fe7158d69432d26e55eb3a7293439c8824acd2a029de55006b&X-Amz-SignedHeaders=host&actor_id=0&key_id=0&repo_id=513814948&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-01.csv.gz&response-content-type=application%2Foctet-stream
Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.111.133, ...
Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 11099245 (11M) [application/octet-stream]
Saving to: ‘green_tripdata_2019-01.csv.gz’

green_tripdata_2019 100%[===================>]  10.58M  3.77MB/s    in 2.8s

2023-01-28 13:47:50 (3.77 MB/s) - ‘green_tripdata_2019-01.csv.gz’ saved [11099245/11099245]

In [12]:
!gunzip green_tripdata_2019-01.csv.gz

In [9]:
!wget https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv

--2023-01-28 13:48:09--  https://s3.amazonaws.com/nyc-tlc/misc/taxi+_zone_lookup.csv
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.102.190, 54.231.170.64, 52.216.212.240, ...
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.102.190|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 12322 (12K) [application/octet-stream]
Saving to: ‘taxi+_zone_lookup.csv’

taxi+_zone_lookup.c 100%[===================>]  12.03K  --.-KB/s    in 0s

2023-01-28 13:48:10 (36.2 MB/s) - ‘taxi+_zone_lookup.csv’ saved [12322/12322]

In [18]:
trip_df = pd.read_csv("./green_tripdata_2019-01.csv")
zone_df = pd.read_csv("taxi+_zone_lookup.csv")

In [19]:
trip_df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [20]:
trip_df.lpep_pickup_datetime = pd.to_datetime(trip_df.lpep_pickup_datetime)
trip_df.lpep_dropoff_datetime = pd.to_datetime(trip_df.lpep_dropoff_datetime)

In [22]:
trip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 630918 entries, 0 to 630917
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               630918 non-null  int64
 1   lpep_pickup_datetime   630918 non-null  datetime64[ns]
 2   lpep_dropoff_datetime  630918 non-null  datetime64[ns]
 3   store_and_fwd_flag     630918 non-null  object
 4   RatecodeID             630918 non-null  int64
 5   PULocationID           630918 non-null  int64
 6   DOLocationID           630918 non-null  int64
 7   passenger_count        630918 non-null  int64
 8   trip_distance          630918 non-null  float64
 9   fare_amount            630918 non-null  float64
 10  extra                  630918 non-null  float64
 11  mta_tax                630918 non-null  float64
 12  tip_amount             630918 non-null  float64
 13  tolls_amount           630918 non-null  float64
 14  ehail_fee              0 non-null       float64
 15  improvement_surcharge  630918 non-null  float64
 16  total_amount           630918 non-null  float64
 17  payment_type           630918 non-null  int64
 18  trip_type              630918 non-null  int64
 19  congestion_surcharge   84538 non-null   float64
dtypes: datetime64[ns](2), float64(10), int64(7), object(1)
memory usage: 96.3+ MB

In [60]:
zone_df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [23]:
zone_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

## Create Postgres connection

In [5]:
engine = create_engine("postgresql://root:root@localhost:5431/ny_taxi")

In [6]:
engine.connect()

## Down data to Postgres database

In [24]:
trip_df.to_sql(name='green_tripdata', con=engine, index=False)

918

In [61]:
zone_df.to_sql(name='zone', con=engine, index=False)

265

## Question 1:  Knowing docker tags  ( Multiple choice)

Which tag has the following text? - Write the image ID to the file?

In [39]:
!docker build --help | grep 'Write the image ID to the file'

      --iidfile string          Write the image ID to the file

## Question 2:  Understanding docker first run  (Multiple choice)

How many python packages/modules are installed?

In [37]:
!docker run -it --rm python:3.9 python -c "import os;os.system('pip list')"

Package    Version
---------- -------
pip        22.0.4
setuptools 58.1.0
wheel      0.38.4
WARNING: You are using pip version 22.0.4; however, version 22.3.1 is available.
You should consider upgrading via the '/usr/local/bin/python -m pip install --upgrade pip' command.

## Question 3: Count records  (Multiple choice)

How many taxi trips were totally made on January 15?

In [28]:
query = """
SELECT DATE(lpep_pickup_datetime) AS lpep_date, 
       COUNT(*)     
  FROM green_tripdata
 WHERE lpep_pickup_datetime::date = '2019-01-15'
 GROUP BY lpep_date
"""

pd.read_sql(query, con=engine)

   count
0  20689

## Question 4: Largest trip for each day (Multiple choice)

Which was the day with the largest trip distance?

In [29]:
query = """
SELECT DATE(lpep_pickup_datetime) AS lpep_date,
       ROUND(SUM(trip_distance)::NUMERIC, 2) AS total_distance
  FROM green_tripdata
 GROUP BY lpep_date
 ORDER BY total_distance DESC
"""

pd.read_sql(query, con=engine)

     lpep_date  total_distance
0   2019-01-25        83745.79
1   2019-01-17        80241.16
2   2019-01-11        79742.42
3   2019-01-10        79530.83
4   2019-01-16        78213.29
5   2019-01-23        76901.52
6   2019-01-18        76829.36
7   2019-01-09        76689.42
8   2019-01-24        75800.41
9   2019-01-26        75098.03
10  2019-01-04        74996.64
11  2019-01-15        74856.26
12  2019-01-29        74613.56
13  2019-01-28        74053.50
14  2019-01-03        73005.01
15  2019-01-22        71712.73
16  2019-01-08        71246.25
17  2019-01-30        71180.07
18  2019-01-31        70496.19
19  2019-01-07        70191.41
20  2019-01-14        69981.51
21  2019-01-12        68087.38
22  2019-01-02        66490.74
23  2019-01-05        63917.11
24  2019-01-19        63335.81
25  2019-01-27        63249.70
26  2019-01-06        61555.35
27  2019-01-13        59211.84
28  2019-01-01        54440.06
29  2019-01-20        46980.27
30  2019-01-21        43066.51
31  2018-12-31           67.04
32  2019-02-01           55.00
33  2009-01-01           42.45
34  2010-09-23           25.45
35  2018-12-07            0.00
36  2018-12-04            0.00
37  2018-12-21            0.00
38  2018-12-05            0.00

## Question 5: The number of passengers  (Multiple choice)

In 2019-01-01 how many trips had 2 and 3 passengers?

In [58]:
query = """
CREATE OR REPLACE FUNCTION passenger_count_view(pickup_date date)
RETURNS TABLE(passenger_count INTEGER) AS $$
    SELECT passenger_count
    FROM green_tripdata
    WHERE lpep_pickup_datetime::date = pickup_date
    AND passenger_count IN (2, 3);
$$ LANGUAGE sql;
"""

def create_func(query):
    import psycopg2
    conn = psycopg2.connect(host="localhost", port="5431", dbname="ny_taxi", user="root", password="root")
    with conn.cursor() as cur:
        cur.execute(query)
    conn.commit()

create_func(query)

In [59]:
query = """
SELECT passenger_count, COUNT(*) AS count_passenger
  FROM passenger_count_view('2019-01-01')
 GROUP BY passenger_count
"""

pd.read_sql(query, con=engine)

   passenger_count  count_passenger
0                3              254
1                2             1282

## Question 6: Largest tip (Multiple choice)

For the passengers picked up in the Astoria Zone which was the drop up zone that had the largest tip?

In [63]:
query = """
WITH max_tips AS (
    SELECT MAX("tip_amount") AS max_tip, "DOLocationID"
    FROM green_tripdata
    WHERE "PULocationID" IN (
        SELECT "LocationID"
        FROM zone
        WHERE "Zone" = 'Astoria'
    )
    GROUP BY "DOLocationID"
)
SELECT z."Zone", mt."max_tip" AS max_tip
FROM max_tips mt
JOIN zone z ON mt."DOLocationID" = z."LocationID"
ORDER BY max_tip DESC
LIMIT 1
"""

pd.read_sql(query, con=engine)

                            Zone  max_tip
0  Long Island City/Queens Plaza     88.0